welcome_text = """
Привет! Выбери расписание:

Так же вы можете обратиться в
@MGTUAssistantBot для помощи с дз.
"""


reg_text = """
Привет, {title}! 👋\nВыберите учебную группу:
"""


help_text = """
В случае возникновения вопросов или желания добавить ваше расписание в бота вы можете обратиться к администратору бота @vladmav_11.

Так же вы можете {podpis} рассылки расписания по утрам:
"""


teacher_text = """
Выберите преподавателя (пожалуйста учитывайте, что тут показываются пара только уже зарегестрированных групп):
"""


DAY_ORDER = ["Monday", "Tuesday", "Wednesday", "Thursday", "Friday", "Saturday", "Sunday"]


WEEKDAYS = {
    1: "Monday",
    2: "Tuesday",
    3: "Wednesday",
    4: "Thursday",
    5: "Friday",
    6: "Saturday",
    7: "Sunday"
}


WEEKDAYS_RU = {
    "Monday": "Понедельник",
    "Tuesday": "Вторник",
    "Wednesday": "Среда",
    "Thursday": "Четверг",
    "Friday": "Пятница",
    "Saturday": "Суббота",
    "Sunday": "Воскресенье"
}


LESSON_NUMBERS = {
    "08:30": 1,
    "10:20": 2,
    "12:10": 3,
    "14:15": 4,
    "16:05": 5,
    "17:55": 6,
}


groups = {
    "uik1-52b": "ИУК1-52Б",
    "uik2-11b": "ИУК2-11Б",
    "uik2-12b": "ИУК2-12Б",
    "uik2-13b": "ИУК2-13Б",
    "uik2-32b": "ИУК2-32Б",
    "uik2-51b": "ИУК2-51Б",
    "uik2-52b": "ИУК2-52Б",
    "uik2-53b": "ИУК2-53Б",
    "uik4-51b": "ИУК4-51Б",
    "uik4-52b": "ИУК4-52Б",
    "uik4-53b": "ИУК4-53Б",
    "uik6-33b": "ИУК6-33Б",
    "mk2-32b": "МК2-32Б",
    "mk3-51b": "МК3-51Б",
}
