welcome_text = """
Привет!👋 Выберите пункт меню:
"""


'''
Так же вы можете обратиться в
@MGTUAssistantBot для помощи с дз.
'''


reg_text = """
Привет, {title}! 👋\nСначала выберите факультет:
"""


help_text = """
В случае возникновения вопросов или желания добавить ваше расписание в бота вы можете обратиться к администратору бота @vladmav_11.

Так же вы можете {podpis} рассылки расписания по утрам:
"""


teacher_text = """
Выберите преподавателя:
"""


DAY_ORDER = ["Monday", "Tuesday", "Wednesday", "Thursday", "Friday", "Saturday", "Sunday"]


WEEKDAYS = {
    1: "Monday",
    2: "Tuesday",
    3: "Wednesday",
    4: "Thursday",
    5: "Friday",
    6: "Saturday",
    7: "Sunday"
}


WEEKDAYS_RU = {
    "Monday": "Понедельник",
    "Tuesday": "Вторник",
    "Wednesday": "Среда",
    "Thursday": "Четверг",
    "Friday": "Пятница",
    "Saturday": "Суббота",
    "Sunday": "Воскресенье"
}


LESSON_NUMBERS = {
    "08:30": 1,
    "10:20": 2,
    "12:10": 3,
    "14:15": 4,
    "16:05": 5,
    "17:55": 6,
    "19:45": 7,
}


groups = {
    "mk1-101": "МК1-101",
    "mk11-21b": "МК11-21Б",
    "mk11-41b": "МК11-41Б",
    "mk11-41m": "МК11-41М",
    "mk11-61b": "МК11-61Б",
    "mk1-21": "МК1-21",
    "mk1-21b": "МК1-21Б",
    "mk1-21m": "МК1-21М",
    "mk1-41": "МК1-41",
    "mk1-41b": "МК1-41Б",
    "mk1-41m": "МК1-41М",
    "mk1-42b": "МК1-42Б",
    "mk1-61": "МК1-61",
    "mk1-61b": "МК1-61Б",
    "mk1-62b": "МК1-62Б",
    "mk1-81": "МК1-81",
    "mk1-81b": "МК1-81Б",
    "mk1-82b": "МК1-82Б",
    "mk2-21b": "МК2-21Б",
    "mk2-21m": "МК2-21М",
    "mk2-41b": "МК2-41Б",
    "mk2-41m": "МК2-41М",
    "mk2-42b": "МК2-42Б",
    "mk2-61b": "МК2-61Б",
    "mk2-81b": "МК2-81Б",
    "mk2-82b": "МК2-82Б",
    "mk3-21a": "МК3-21А",
    "mk3-21b": "МК3-21Б",
    "mk3-21m": "МК3-21М",
    "mk3-41b": "МК3-41Б",
    "mk3-41m": "МК3-41М",
    "mk3-61b": "МК3-61Б",
    "mk3-81b": "МК3-81Б",
    "mk3-82b": "МК3-82Б",
    "mk6-101": "МК6-101",
    "mk6-21": "МК6-21",
    "mk6-21a": "МК6-21А",
    "mk6-41": "МК6-41",
    "mk6-61": "МК6-61",
    "mk6-81": "МК6-81",
    "mk7-21b": "МК7-21Б",
    "mk7-21m": "МК7-21М",
    "mk7-22b": "МК7-22Б",
    "mk7-41b": "МК7-41Б",
    "mk7-41m": "МК7-41М",
    "mk7-42b": "МК7-42Б",
    "mk7-61b": "МК7-61Б",
    "mk7-62b": "МК7-62Б",
    "mk7-81b": "МК7-81Б",
    "mk7-82b": "МК7-82Б",
    "mk8-21b": "МК8-21Б",
    "mk8-21m": "МК8-21М",
    "mk8-22a": "МК8-22А",
    "mk8-22b": "МК8-22Б",
    "mk8-41b": "МК8-41Б",
    "mk8-41m": "МК8-41М",
    "mk8-42b": "МК8-42Б",
    "mk8-61b": "МК8-61Б",
    "mk8-62b": "МК8-62Б",
    "mk8-81b": "МК8-81Б",
    "mk8-82b": "МК8-82Б",
    "mk9-101": "МК9-101",
    "mk9-21": "МК9-21",
    "mk9-21b": "МК9-21Б",
    "mk9-22a": "МК9-22А",
    "mk9-41": "МК9-41",
    "mk9-41b": "МК9-41Б",
    "mk9-61": "МК9-61",
    "mk9-81": "МК9-81",
    "uik11-21b": "ИУК11-21Б",
    "uik11-41b": "ИУК11-41Б",
    "uik1-21a": "ИУК1-21А",
    "uik1-21b": "ИУК1-21Б",
    "uik1-21m": "ИУК1-21М",
    "uik1-22b": "ИУК1-22Б",
    "uik1-29b": "ИУК1-29Б",
    "uik1-41b": "ИУК1-41Б",
    "uik1-41m": "ИУК1-41М",
    "uik1-42b": "ИУК1-42Б",
    "uik1-49b": "ИУК1-49Б",
    "uik1-61b": "ИУК1-61Б",
    "uik1-62b": "ИУК1-62Б",
    "uik1-69b": "ИУК1-69Б",
    "uik1-81b": "ИУК1-81Б",
    "uik1-82b": "ИУК1-82Б",
    "uik2-21b": "ИУК2-21Б",
    "uik2-21m": "ИУК2-21М",
    "uik2-22b": "ИУК2-22Б",
    "uik2-23b": "ИУК2-23Б",
    "uik2-41b": "ИУК2-41Б",
    "uik2-41m": "ИУК2-41М",
    "uik2-42b": "ИУК2-42Б",
    "uik2-43b": "ИУК2-43Б",
    "uik2-61b": "ИУК2-61Б",
    "uik2-62b": "ИУК2-62Б",
    "uik2-63b": "ИУК2-63Б",
    "uik2-81b": "ИУК2-81Б",
    "uik2-82b": "ИУК2-82Б",
    "uik3-21b": "ИУК3-21Б",
    "uik3-21m": "ИУК3-21М",
    "uik3-22b": "ИУК3-22Б",
    "uik3-41b": "ИУК3-41Б",
    "uik3-41m": "ИУК3-41М",
    "uik3-42b": "ИУК3-42Б",
    "uik3-61b": "ИУК3-61Б",
    "uik3-62b": "ИУК3-62Б",
    "uik3-81b": "ИУК3-81Б",
    "uik3-82b": "ИУК3-82Б",
    "uik4-21a": "ИУК4-21А",
    "uik4-21b": "ИУК4-21Б",
    "uik4-21m": "ИУК4-21М",
    "uik4-22b": "ИУК4-22Б",
    "uik4-23b": "ИУК4-23Б",
    "uik4-41b": "ИУК4-41Б",
    "uik4-41m": "ИУК4-41М",
    "uik4-42b": "ИУК4-42Б",
    "uik4-43b": "ИУК4-43Б",
    "uik4-61b": "ИУК4-61Б",
    "uik4-62b": "ИУК4-62Б",
    "uik4-63b": "ИУК4-63Б",
    "uik4-81b": "ИУК4-81Б",
    "uik4-82b": "ИУК4-82Б",
    "uik5-21b": "ИУК5-21Б",
    "uik5-21m": "ИУК5-21М",
    "uik5-22b": "ИУК5-22Б",
    "uik5-23b": "ИУК5-23Б",
    "uik5-41b": "ИУК5-41Б",
    "uik5-41m": "ИУК5-41М",
    "uik5-42b": "ИУК5-42Б",
    "uik5-43b": "ИУК5-43Б",
    "uik5-61b": "ИУК5-61Б",
    "uik5-62b": "ИУК5-62Б",
    "uik5-63b": "ИУК5-63Б",
    "uik5-81b": "ИУК5-81Б",
    "uik5-82b": "ИУК5-82Б",
    "uik6-101": "ИУК6-101",
    "uik6-21": "ИУК6-21",
    "uik6-23": "ИУК6-23",
    "uik6-29": "ИУК6-29",
    "uik6-41": "ИУК6-41",
    "uik6-43": "ИУК6-43",
    "uik6-49": "ИУК6-49",
    "uik6-61": "ИУК6-61",
    "uik6-81": "ИУК6-81",
    "uik6-89": "ИУК6-89",
    "uik7-21b": "ИУК7-21Б",
    "uik7-41b": "ИУК7-41Б",
    "uik7-41m": "ИУК7-41М",
    "uik7-81b": "ИУК7-81Б"
}


'''
    "uik1-52b": "ИУК1-52Б",
    "uik2-11b": "ИУК2-11Б",
    "uik2-12b": "ИУК2-12Б",
    "uik2-13b": "ИУК2-13Б",
    "uik2-32b": "ИУК2-32Б",
    "uik2-51b": "ИУК2-51Б",
    "uik2-52b": "ИУК2-52Б",
    "uik2-53b": "ИУК2-53Б",
    "uik4-51b": "ИУК4-51Б",
    "uik4-52b": "ИУК4-52Б",
    "uik4-53b": "ИУК4-53Б",
    "uik6-33b": "ИУК6-33Б",
    "mk2-32b": "МК2-32Б",
    "mk3-51b": "МК3-51Б",
'''
