welcome_text = """
Привет! Выбери расписание:
"""


reg_text = """
Привет, {title}! 👋\nВыберите учебную группу:
"""


help_text = """
В случае возникновения вопросов или желания добавить ваше расписание в бота вы можете обратиться к администратору бота @vladmav_11.

Так же вы можете {podpis} рассылки:
"""


DAY_ORDER = ["Monday", "Tuesday", "Wednesday", "Thursday", "Friday", "Saturday", "Sunday"]


WEEKDAYS = {
    1: "Monday",
    2: "Tuesday",
    3: "Wednesday",
    4: "Thursday",
    5: "Friday",
    6: "Saturday",
    7: "Sunday"
}


WEEKDAYS_RU = {
    "Monday": "Понедельник",
    "Tuesday": "Вторник",
    "Wednesday": "Среда",
    "Thursday": "Четверг",
    "Friday": "Пятница",
    "Saturday": "Суббота",
    "Sunday": "Воскресенье"
}


groups = {
    "uik2-32b": "ИУК2-32Б",
    "uik2-51b": "ИУК2-51Б",
    "uik2-52b": "ИУК2-52Б",
    "uik2-53b": "ИУК2-53Б",
    "uik1-52b": "ИУК1-52Б"
}
